1. Konfigurasi Router Mataram
# Mengatur Hostname Router Mataram 
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ho RTR_MATARAM

# Mengatur alamat IP Address di tiap masing-masing interface
RTR_MATARAM(config)#int gig 0/0/0
RTR_MATARAM(config-if)#ip addr 192.168.1.1 255.255.255.0 
RTR_MATARAM(config-if)#no sh

RTR_MATARAM(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

RTR_MATARAM(config-if)#int se
RTR_MATARAM(config-if)#int se0/1/0
RTR_MATARAM(config-if)#ip addr 192.168.0.1 255.255.255.252
RTR_MATARAM(config-if)#no sh

# Cek alamat IP interface
RTR_MATARAM(config-if)#do sh ip int br
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.1.1     YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
GigabitEthernet0/0/2   unassigned      YES unset  administratively down down 
Serial0/1/0            192.168.0.1     YES manual down                  down 
Serial0/1/1            unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
RTR_MATARAM(config-if)#ex

# Atur Password Previledge dan SSH Server di Router Mataram
RTR_MATARAM(config)#enable secret menanti
RTR_MATARAM(config)#ip domain-name sabarmenanti.com
RTR_MATARAM(config)#crypto key generate rsa general-keys modulus 1024
The name for the keys will be: RTR_MATARAM.sabarmenanti.com

% The key modulus size is 1024 bits
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]
*Feb 28 23:13:59.28: %SSH-5-ENABLED: SSH 1.99 has been enabled

# Atur Shell SSH Server di Router Mataram
RTR_MATARAM(config)#username sabar password menanti
RTR_MATARAM(config)#line vty 0 4
RTR_MATARAM(config-line)#login local
RTR_MATARAM(config-line)#transport input ssh
RTR_MATARAM(config-line)#exit

# Atur DHCP Pool dan Excluded Address di Router Mataram
RTR_MATARAM(config)#ip dhcp pool MATARAM
RTR_MATARAM(dhcp-config)#network 192.168.1.0 255.255.255.0
RTR_MATARAM(dhcp-config)#default-router 192.168.1.1
RTR_MATARAM(dhcp-config)#dns-server 192.168.1.253
RTR_MATARAM(dhcp-config)#ex
RTR_MATARAM(config)#ip dhcp excluded-address 192.168.1.1 192.168.1.2
RTR_MATARAM(config)#ip dhcp excluded-address 192.168.1.253 192.168.1.254

# Konfigurasi Router EIGRP dengan nomor AS 64512 di Router Mataram
RTR_MATARAM(config)#router eigrp 64512
RTR_MATARAM(config-router)#network 192.168.1.0
RTR_MATARAM(config-router)#network 192.168.0.0

# Melihat verifikasi konfigurasi dan save konfigurasi di Router Mataram
RTR_MATARAM(config)#do sh ip protocols

Routing Protocol is "eigrp  64512 " 
  Outgoing update filter list for all interfaces is not set 
  Incoming update filter list for all interfaces is not set 
  Default networks flagged in outgoing updates  
  Default networks accepted from incoming updates 
  EIGRP metric weight K1=1, K2=0, K3=1, K4=0, K5=0
  EIGRP maximum hopcount 100
  EIGRP maximum metric variance 1
Redistributing: eigrp 64512
  Automatic network summarization is not in effect  
  Maximum path: 4
  Routing for Networks:  
     192.168.1.0
     192.168.0.0
  Routing Information Sources:  
    Gateway         Distance      Last Update 
  Distance: internal 90 external 170

RTR_MATARAM(config)#do copy run start
Destination filename [startup-config]? 
Building configuration...

2. Konfigurasi Multilayer Switch Mataram
# Mengatur Hostname Multilayer Switch Mataram
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname MSW_MATARAM

