1. Konfigurasi Router Mataram
# Mengatur Hostname Router Mataram 
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ho RTR_MATARAM

# Mengatur alamat IP Address di tiap masing-masing interface
RTR_MATARAM(config)#int gig 0/0/0
RTR_MATARAM(config-if)#ip addr 192.168.1.1 255.255.255.0 
RTR_MATARAM(config-if)#no sh

RTR_MATARAM(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

RTR_MATARAM(config-if)#int se
RTR_MATARAM(config-if)#int se0/1/0
RTR_MATARAM(config-if)#ip addr 192.168.0.1 255.255.255.252
RTR_MATARAM(config-if)#no sh

# Cek alamat IP interface
RTR_MATARAM(config-if)#do sh ip int br
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.1.1     YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
GigabitEthernet0/0/2   unassigned      YES unset  administratively down down 
Serial0/1/0            192.168.0.1     YES manual down                  down 
Serial0/1/1            unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
RTR_MATARAM(config-if)#ex

# Atur Password Previledge dan SSH Server di Router Mataram
RTR_MATARAM(config)#enable secret menanti
RTR_MATARAM(config)#ip domain-name sabarmenanti.com
RTR_MATARAM(config)#crypto key generate rsa general-keys modulus 1024
The name for the keys will be: RTR_MATARAM.sabarmenanti.com

% The key modulus size is 1024 bits
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]
*Feb 28 23:13:59.28: %SSH-5-ENABLED: SSH 1.99 has been enabled

# Atur Shell SSH Server di Router Mataram
RTR_MATARAM(config)#username sabar password menanti
RTR_MATARAM(config)#line vty 0 4
RTR_MATARAM(config-line)#login local
RTR_MATARAM(config-line)#transport input ssh
RTR_MATARAM(config-line)#exit

# Atur DHCP Pool dan Excluded Address di Router Mataram
RTR_MATARAM(config)#ip dhcp pool MATARAM
RTR_MATARAM(dhcp-config)#network 192.168.1.0 255.255.255.0
RTR_MATARAM(dhcp-config)#default-router 192.168.1.1
RTR_MATARAM(dhcp-config)#dns-server 192.168.1.253
RTR_MATARAM(dhcp-config)#ex
RTR_MATARAM(config)#ip dhcp excluded-address 192.168.1.1 192.168.1.2
RTR_MATARAM(config)#ip dhcp excluded-address 192.168.1.253 192.168.1.254

# Konfigurasi Router EIGRP dengan nomor AS 64512 di Router Mataram
RTR_MATARAM(config)#router eigrp 64512
RTR_MATARAM(config-router)#network 192.168.1.0
RTR_MATARAM(config-router)#network 192.168.0.0

# Melihat verifikasi konfigurasi dan save konfigurasi di Router Mataram
RTR_MATARAM(config)#do sh ip protocols

Routing Protocol is "eigrp  64512 " 
  Outgoing update filter list for all interfaces is not set 
  Incoming update filter list for all interfaces is not set 
  Default networks flagged in outgoing updates  
  Default networks accepted from incoming updates 
  EIGRP metric weight K1=1, K2=0, K3=1, K4=0, K5=0
  EIGRP maximum hopcount 100
  EIGRP maximum metric variance 1
Redistributing: eigrp 64512
  Automatic network summarization is not in effect  
  Maximum path: 4
  Routing for Networks:  
     192.168.1.0
     192.168.0.0
  Routing Information Sources:  
    Gateway         Distance      Last Update 
  Distance: internal 90 external 170

RTR_MATARAM(config)#do copy run start
Destination filename [startup-config]? 
Building configuration...

2. Konfigurasi Multilayer Switch Mataram
# Mengatur Hostname Multilayer Switch Mataram
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname MSW_MATARAM

# Tambah interface SVI lalu atur IP Address serta default gateway
MSW_MATARAM(config)#int vlan 1
MSW_MATARAM(config-if)#ip addr 192.168.1.2 255.255.255.0
MSW_MATARAM(config-if)#no sh

MSW_MATARAM(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

MSW_MATARAM(config-if)#exit
MSW_MATARAM(config)#ip default-gateway 192.168.1.1
MSW_MATARAM(config)#

# Verifikasi SVI VLAN 1 dan default gateway
MSW_MATARAM(config)#do sh int vlan1
Vlan1 is up, line protocol is up
  Hardware is CPU Interface, address is 0001.42e4.7154 (bia 0001.42e4.7154)
  Internet address is 192.168.1.2/24
  MTU 1500 bytes, BW 100000 Kbit, DLY 1000000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 21:40:21, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     1682 packets input, 530955 bytes, 0 no buffer
     Received 0 broadcasts (0 IP multicast)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     563859 packets output, 0 bytes, 0 underruns
     0 output errors, 23 interface resets
     0 output buffer failures, 0 output buffers swapped out

MSW_MATARAM(config)#do sh run | include ip default-gateway
ip default-gateway 192.168.1.1

# Konfigurasi password Previledge dan SSH Server di Multilayer Switch Mataram
MSW_MATARAM(config)#enable secret menanti
MSW_MATARAM(config)#ip domain-name sabarmenanti.com
MSW_MATARAM(config)#crypto key generate rsa general-keys modulus 1024
The name for the keys will be: MSW_MATARAM.sabarmenanti.com

% The key modulus size is 1024 bits
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]
*Mar 1 0:44:0.713: %SSH-5-ENABLED: SSH 1.99 has been enabled

# Atur SSH Server di Multilayer Switch Mataram
MSW_MATARAM(config)#username sabar password menanti
MSW_MATARAM(config)#line vty 0 4
MSW_MATARAM(config-line)#login local
MSW_MATARAM(config-line)#trans
MSW_MATARAM(config-line)#transport input ssh
MSW_MATARAM(config-line)#end

# Simpan konfigurasi di Multilayer Switch Mataram
MSW_MATARAM#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]

3. Konfigurasi Router Sumbawa
# Mengatur Hostname Router Sumbawa
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname RTR_SUMBAWA

# Konfigurasi IP Address pada masing-masing interface di Router Sumbawa
RTR_SUMBAWA(config)#int gig0/0/0
RTR_SUMBAWA(config-if)#ip addr 192.168.2.1 255.255.255.0
RTR_SUMBAWA(config-if)#no sh

RTR_SUMBAWA(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

RTR_SUMBAWA(config-if)#int se0/1/0
RTR_SUMBAWA(config-if)#ip addr 192.168.0.2 255.255.255.252
RTR_SUMBAWA(config-if)#no sh

RTR_SUMBAWA(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/0, changed state to up

RTR_SUMBAWA(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0, changed state to up

RTR_SUMBAWA(config-if)#int se0/1/1
RTR_SUMBAWA(config-if)#ip addr 192.168.0.5 255.255.255.252
RTR_SUMBAWA(config-if)#no sh

%LINK-5-CHANGED: Interface Serial0/1/1, changed state to down

# Verifikasi IP Address pada masing-masing interface di Router Sumbawa
RTR_SUMBAWA(config)#do sh ip int br
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.2.1     YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
GigabitEthernet0/0/2   unassigned      YES unset  administratively down down 
Serial0/1/0            192.168.0.2     YES manual up                    up 
Serial0/1/1            192.168.0.5     YES manual down                  down 
Vlan1                  unassigned      YES unset  administratively down down

# Konfigurasi password Previledge dan SSH Server di Router Sumbawa
RTR_SUMBAWA(config)#enable secret menanti
RTR_SUMBAWA(config)#ip domain-name sabarmenanti.com
RTR_SUMBAWA(config)#crypto key generate rsa general-keys modulus 1024
The name for the keys will be: RTR_SUMBAWA.sabarmenanti.com

% The key modulus size is 1024 bits
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]
*Mar 1 1:52:0.695: %SSH-5-ENABLED: SSH 1.99 has been enabled

# Atur SSH Server di Router Sumbawa
RTR_SUMBAWA(config)#username sabar password menanti
RTR_SUMBAWA(config)#line vty 0 4
RTR_SUMBAWA(config-line)#login local
RTR_SUMBAWA(config-line)#transport input ssh
RTR_SUMBAWA(config-line)#exit

#Atur DHCP Server di Router Sumbawa
RTR_SUMBAWA(config)#ip dhcp pool SUMBAWA
RTR_SUMBAWA(dhcp-config)#network 192.168.2.0 255.255.255.0
RTR_SUMBAWA(dhcp-config)#default-router 192.168.2.1
RTR_SUMBAWA(dhcp-config)#dns-server 192.168.1.253
RTR_SUMBAWA(dhcp-config)#exit
RTR_SUMBAWA(config)#ip dhcp excluded-address 192.168.2.1 192.168.1.2

#Atur Routing EIGRP di Router Sumbawa
RTR_SUMBAWA(config)#router eigrp 64512
RTR_SUMBAWA(config-router)#network 192.168.2.0
RTR_SUMBAWA(config-router)#network 192.168.0.0
RTR_SUMBAWA(config-router)#
%DUAL-5-NBRCHANGE: IP-EIGRP 64512: Neighbor 192.168.0.1 (Serial0/1/0) is up: new adjacency

RTR_SUMBAWA(config-router)#end

#Atur hostname di Multilayer Switch Sumbawa
Switch>enable
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname MSW_SUMBAWA

#Atur IP Default Gateway di Multilayer Switch Sumbawa
MSW_SUMBAWA(config)#ip default-gateway 192.168.2.1

#Atur Password Previledge dan SSH Server di Multilayer Switch Sumbawa
MSW_SUMBAWA(config)#enable secret menanti
MSW_SUMBAWA(config)#ip domain-name sabarmenanti.com
MSW_SUMBAWA(config)#crypto key generate rsa general-keys modulus 1024
MSW_SUMBAWA(config)#user sabar password menanti
MSW_SUMBAWA(config)#line vty 0 4
MSW_SUMBAWA(config-line)#login local
MSW_SUMBAWA(config-line)#transport input ssh
MSW_SUMBAWA(config-line)#end

#Atur hostname di Router Sumbawa
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname RTR_BIMA

